IDEA StatiCa Open Model
RebarShape.StartHook Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the start rebar hook.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public RebarHookBase StartHook { get; set; }
Public Property StartHook As RebarHookBase
	Get
	Set
public:
property RebarHookBase^ StartHook {
	RebarHookBase^ get ();
	void set (RebarHookBase^ value);
}
Property Value
Type: RebarHookBase
See Also
Reference
RebarShape Class
IdeaRS.OpenModel.Model Namespace